a = []
a.push(1)    #=> [1]
# 2と3を一度に追加する
a.push(2, 3) #=> [1, 2, 3]

# ----------------------------------------

a = []
b = [2, 3]
a.push(1) #=> [1]
# 配列をそのまま追加する（a.push([2, 3])と同じ）
a.push(b)
a #=> [1, [2, 3]]

# ----------------------------------------

a = []
b = [2, 3]
a.push(1)  #=> [1]
# 配列を*付きで追加する（a.push(2, 3)と同じ）
a.push(*b) #=> [1, 2, 3]

# ----------------------------------------

jp = ['japan', '日本']
country = '日本'
case country
# *により配列が展開され、when 'japan', '日本'と書いたのと同じ意味になる
when *jp
  'こんにちは'
end
#=> "こんにちは"
