a, b = 1, 2
a #=> 1
b #=> 2

# ----------------------------------------

# 配列を使って多重代入する
a, b = [1, 2]
a #=> 1
b #=> 2

# 右辺の数が少ない場合はnilが入る
c, d = [10]
c #=> 10
d #=> nil

# 右辺の数が多い場合ははみ出した値が切り捨てられる
e, f = [100, 200, 300]
e #=> 100
f #=> 200

# ----------------------------------------

# divmodは商と余りを配列で返す
14.divmod(3) #=> [4, 2]

# 戻り値を配列のまま受け取る
quo_rem = 14.divmod(3)
"商=#{quo_rem[0]}, 余り=#{quo_rem[1]}" #=> "商=4, 余り=2"

# 多重代入で別々の変数として受け取る
quotient, remainder = 14.divmod(3)
"商=#{quotient}, 余り=#{remainder}"    #=> "商=4, 余り=2"

