# コラム：エイリアスメソッドがたくさんあるのはなぜ？

# mapはLisp由来、collectはSmalltalk由来
[1, 2, 3].map { |n| n * 10 }     #=> [10, 20, 30]
[1, 2, 3].collect { |n| n * 10 } #=> [10, 20, 30]

# ----------------------------------------

# 配列の大きさは？
[1, 2, 3].size   #=> 3

# 配列の長さは？
[1, 2, 3].length #=> 3

# ----------------------------------------

# thenメソッドの使用例
# nには10が入り、10 * 3 = 30がメソッドの戻り値になる
10.then { |n| n * 3 } #=> 30

# ----------------------------------------

# translateの短縮形としてのtメソッド
I18n.translate 'foo.bar'
I18n.t 'foo.bar'

# 単数形のdayメソッドと複数形のdaysメソッド
Date.today + 1.day
Date.today + 2.days
